<template>
  <div>
    <h1>中小学智能排课系统使用说明文档</h1>
    <h1>我们设计的本系统是中小学智能排课系统主要针对如下用户类型，包括教师、学生、系统管理员。</h1>  
    <h1>系统的主要功能如下：</h1> 
    <h1>1.实现班级、课程等基本信息的管理；</h1> 
    <h1>2.实现学生、教师信息的管理；</h1> 
    <h1>3.实现为每个班级和每位教师打印课程表；</h1> 
    <h1>4.教学区域信息的管理；</h1> 
    <h1>5.管理员能够在自动排出的课程表上进行手动调课；</h1> 
    <h1>6.本系统具有数据备份和数据恢复功能。</h1> 
  </div>
</template>

<script>
export default {
  name: 'Help',
  data() {
    return {

    }
  },
  mounted() {

  },
  methods: {

  }
}
</script>

<style lang="less" scoped>

</style>